---
title: "alias and avg 8.5"
date: 2009-04-26
forum: New to Ubuntu
---

### Post by lance bermudez on 2009-04-26
i have tried 

alias update='sudo apt-get update'
alias upgrade='sudo apt-get upgrade'
alias home='cd /home/lance'
alias documents='cd /home/lance/Documents'
alias downloads='cd /home/lance/downloads'
alias openline='cd /home/lance/MyDownloads'
alias shared='cd /home/lance/Shared'
alias whereami=pwd
alias whereareyou=pwd
alias where=pwd
alias whoareyou=whoami
alias full=Ā´avgscan -H /home/lanceĀ´
alias update2=Ā´sudo avgupdate -p 2Ā´

and

alias update=ĀØsudo apt-get updateĀØ
alias upgrade=ĀØsudo apt-get upgradeĀØ
alias home=ĀØcd /home/lanceĀØ
alias documents=ĀØcd /home/lance/DocumentsĀØ
alias downloads=ĀØcd /home/lance/downloadsĀØ
alias openline=ĀØcd /home/lance/MyDownloadsĀØ
alias shared=ĀØcd /home/lance/SharedĀØ
alias whereami=pwd
alias whereareyou=pwd
alias where=pwd
alias whoareyou=whoami
alias full=ĀØavgscan -H /home/lanceĀØ

it still does not work I have done some old post on this at [http://ubuntuforums.org/showthread.php?p=7145538#post7145538](http://ubuntuforums.org/showthread.php?p=7145538#post7145538) I now have a new problem when i open a terminal i have

bash: alias: apt-get: not found
bash: alias: updateĀØ: not found
bash: alias: apt-get: not found
bash: alias: upgradeĀØ: not found
bash: alias: /home/lanceĀØ: not found
bash: alias: /home/lance/DocumentsĀØ: not found
bash: alias: /home/lance/downloadsĀØ: not found
bash: alias: /home/lance/MyDownloadsĀØ: not found
bash: alias: /home/lance/SharedĀØ: not found
bash: alias: -H: not found
bash: alias: /home/lanceĀØ: not found
lance@bermudez:~$ 

what am i doing wrong? sence i changed my (Ā´) to (ĀØ) nun of my alias work now.

---

### Post by llamabr on 2009-04-26
That's strange.  Where are you putting these?

It looks like toward the bottom you missed some quotes, namely with the pwd commands.  Try just putting in one at a time, and see if it works.

---

### Post by llamabr on 2009-04-26
What do you mean you're running avg 8.5?  isn't that a windows based virus blocker?  Why are you running it, and why is it relevant to your post?

---

### Post by lance bermudez on 2009-04-26
in /home/lance/.bash_aliases is where they are being put. I have found out what my problem is my(ĀØ) looks as shown and i have to hold shift and press the key twice for the mark to display so i copied and pasted the (") from the help form and things now work right. I think I might need to reinstall my keyboard does any one know how to do that I need a gui and for more info I using a acer aspire 4720z labtop. i have attached my aliases in case anyone wants to look at them. thank you for all your help everyone.

---

